30-rails-api/movies-api/app/controllers/api/v1/movies_controller.rb

SELECT "movies".* FROM "movies"
---
  def index
    movies = Movie.all.sort_by { |movie| movie.title }

SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "movies" SET "score" = $1, "updated_at" = $2 WHERE "movies"."id" = $3  [["score", 20], ["updated_at", "2020-02-24 16:44:05.194986"], ["id", 1]]
---
  def update
    movie = Movie.find(params[:id])
    movie.update(movie_params)

SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "movies" WHERE "movies"."id" = $1  [["id", 4]]
---
  def destroy
    movie = Movie.find(params[:id])

    movie.destroy